Retrieves a box that circumscribes the solid geometry.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public BoundingBoxXYZ GetBoundingBox()
  Visual Basic
Public Function GetBoundingBox As BoundingBoxXYZ
  Visual C++
public:
BoundingBoxXYZ^ GetBoundingBox()
 See Also
  Solid Class
  Autodesk.Revit.DB Namespace